# Задание 1
inp = input(f"Введите слово: ")
print(inp)

inp = int(input(f"Введите  число: "))
print(f"Введённое число +10 равно: {inp + 10}")
